//指令编码及指令有关定义

/****************************************************************************/
/*								common define								*/
/****************************************************************************/
`define OPCODE				31:26
`define AluOpBus 			 7:0
`define AluSelBus 			 2:0

//AluSel(运算类型)逻辑/算数/...
`define EXE_RES_NOP 		3'b000
`define EXE_RES_LOGIC 		3'b001

//AluOp(运算子类型)，比如逻辑运算又分为或/与/非/...
`define EXE_NOP_OP    		8'b00000000
`define EXE_OR_OP    		8'b00100101






/****************************************************************************/
/*								   I型指令格式						    	*/
/****************************************************************************/
`define I_RS_REG			25:21
`define I_RT_REG			20:16
`define I_IMM				15:0
`define I_IMM_EXT			16'h0

//指令码（opcode）
`define EXE_NOP 			6'b000000
`define EXE_ORI  			6'b001101

/****************************************************************************/
/*								   R型指令格式						    	*/
/****************************************************************************/
`define R_RS_REG			25:21
`define R_RT_REG			20:16
`define R_RD_REG			15:11
`define R_SA   				10:6
`define R_FUNC				 5:0